; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob26) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - pallet
	crate0 crate1 crate2 crate3 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 depot0)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 distributor1)
	(clear crate2)
	(at pallet10 distributor0)
	(clear crate1)
	(at pallet11 distributor2)
	(clear pallet11)
	(at pallet12 depot0)
	(clear crate3)
	(at pallet13 distributor1)
	(clear pallet13)
	(at truck0 distributor2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 318)
	(at truck1 depot2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 381)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at crate0 depot0)
	(on crate0 pallet12)
	(= (weight crate0) 25)
	(at crate1 distributor0)
	(on crate1 pallet10)
	(= (weight crate1) 53)
	(at crate2 distributor1)
	(on crate2 pallet9)
	(= (weight crate2) 70)
	(at crate3 depot0)
	(on crate3 crate0)
	(= (weight crate3) 1)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet11)
		(on crate1 pallet7)
		(on crate2 pallet5)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist3 crate1 pallet10 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 pallet10)
   added: (lifting hoist3 crate1) (clear pallet10)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 3
2. (lift hoist4 crate2 pallet9 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist4) (on crate2 pallet9)
   added: (lifting hoist4 crate2) (clear pallet9)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 3
3. (lift hoist0 crate3 crate0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate0)
   added: (lifting hoist0 crate3) (clear crate0)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 3
4. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 0 of 3
5. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 3
6. (load hoist3 crate1 truck0 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 53
   goals met: 0 of 3
7. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 3
8. (load hoist4 crate2 truck0 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck0) (available hoist4)
   changed: (current_load truck0) from 53 to 123
   goals met: 0 of 3
9. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 23 to 33
   goals met: 0 of 3
10. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck0) from 123 to 70
   goals met: 0 of 3
11. (drop hoist0 crate1 pallet7 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet7)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet7)
   goals met: 1 of 3
12. (lift hoist0 crate0 pallet12 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet12)
   added: (lifting hoist0 crate0) (clear pallet12)
   changed: (fuel-cost) from 33 to 34
   goals met: 1 of 3
13. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 70 to 95
   goals met: 1 of 3
14. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 34 to 44
   goals met: 1 of 3
15. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   changed: (current_load truck0) from 95 to 70
   goals met: 1 of 3
16. (drop hoist5 crate0 pallet11 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet11)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet11)
   goals met: 2 of 3
17. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   changed: (current_load truck0) from 70 to 0
   goals met: 2 of 3
18. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 3 of 3
